// src/pages/IdeaPage.jsx
import { Box, Title, Text } from "@mantine/core";

export default function IdeaPage() {
  return (
    <Box py="xl" px="md" maw={900} mx="auto">
      <Title order={2} mb="md">Нашата идея</Title>
      <Text component="div" size="md" style={{ whiteSpace: "pre-line", lineHeight: 1.6 }}>
        {`ДАР ОТ ЗЕМЯТА е онлайн ПЛАТФОРМА , предлагаща истински продукти от различни ферми.

Дар от Земята е спасението на градския човек, който иска да пазарува чиста храна както от малки български ферми, така и екзотични продукти на топ качество, произведена с грижа както за неговото здраве, така и за природата. Платформата предлага стотици продукти от десетки производители, които могат да се поръчат само с няколко кликвания на мишката. Фермерите получават честно заплащане, а потребителите - една удобна доставка с истинска и свежа храна в рамките на цялата страна. А клиентите в София могат да пазаруват и от нашите магазини.

Чрез ежедневното зареждане и постоянни контакти с нашите ферми гарантираме свежестта на продуктите и разхищаването на храна. Фокусът е върху сезонна, натурално произведена продукция, затова задължително условие за производителите е да не използват пестициди, консерванти и подобрители и да следват изискванията за устойчиво земеделие.

Ще се радваме , точно Вие да бъдете най-новите ни и доволни клиенти.`}
      </Text>
    </Box>
  );
}
